In [1]:
import pandas as pd

In [2]:
s= pd.Series([10,20,30,40,50])

In [3]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# it acn be labelled with customized datatypes 
marks=pd.Series([30,30,30,40], index=['harry','harru','shubh','masoom'])

In [6]:
marks

harry     30
harru     30
shubh     30
masoom    40
dtype: int64

In [7]:
## dataframe 
# its a 2-d dataframe 
data={
    'Name': ['harry','harru','shubh','masoom'],
    'Age':[23,22,21,20],
    'RollNo': [1,2,3,4]
}

df=pd.DataFrame(data)

In [8]:
df

     Name  Age  RollNo
0   harry   23       1
1   harru   22       2
2   shubh   21       3
3  masoom   20       4

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df.columns

Index(['Name', 'Age', 'RollNo'], dtype='object')

In [13]:
df.index=['a','b','c','d']

In [14]:
df

     Name  Age  RollNo
a   harry   23       1
b   harru   22       2
c   shubh   21       3
d  masoom   20       4